Masmiseim36/nxpSDK/boards/evkmimxrt685/aws_examples/remote_control_wifi_nxp/pin_mux.h
/*
 * Copyright 2019-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_TXD_SCL_MISO_WS (coord G2), J16[1]/U27[3]/U9[12]
  @{ */
/* @} */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord G4), JP21[2]/U28[3]/U9[13]
  @{ */
/* @} */

/*! @name SD0_CARD_DET_N (coord R13), J32[10]/CARD_CD/SD_CD
  @{ */
                                                           /* @} */

/*! @name SD0_CLK (coord P10), J32[5]/SD_CLK
  @{ */
                                                    /* @} */

/*! @name SD0_CMD (coord R9), J32[2]/SD_CMD
  @{ */
                                                    /* @} */

/*! @name SD0_D0 (coord R11), J32[7]/SD_DAT0
  @{ */
                                                      /* @} */

/*! @name SD0_D1 (coord T11), J32[8]/SD_DAT1
  @{ */
                                                      /* @} */

/*! @name SD0_D2 (coord U11), J32[9]/SD_DAT2
  @{ */
                                                      /* @} */

/*! @name SD0_D3 (coord T12), J32[1]/SD_DAT3
  @{ */
                                                      /* @} */

/*! @name PIO2_10 (coord T15), U23[3]/SD_RST_N
  @{ */
#define BOARD_INITPINS_SD_RST_N_GPIO GPIO               /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SD_RST_N_PORT 2U                 /*!<@brief PORT device name: 2U */
#define BOARD_INITPINS_SD_RST_N_PIN 10U                 /*!<@brief 2U pin index: 10 */
                                                        /* @} */

/*! @name PIO2_4 (coord T13), J32[11]/CARD_WR_PRT/SD_WR_PRT
  @{ */
#define BOARD_INITPINS_SD_WR_PRT_GPIO GPIO                             /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SD_WR_PRT_PORT 2U                               /*!<@brief PORT device name: 2U */
#define BOARD_INITPINS_SD_WR_PRT_PIN 4U                                /*!<@brief 2U pin index: 4 */
                                                                       /* @} */

/*! @name PIO0_26 (coord A2), Q3[2]
  @{ */
#define BOARD_INITPINS_LED_BLUE_GPIO GPIO        /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED_BLUE_PORT 0U          /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LED_BLUE_PIN 26U          /*!<@brief 0U pin index: 26 */
                                                 /* @} */

/*! @name PIO0_31 (coord A11), Q4[2]
  @{ */
#define BOARD_INITPINS_LED_RED_GPIO GPIO        /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED_RED_PORT 0U          /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LED_RED_PIN 31U          /*!<@brief 0U pin index: 31 */
                                                /* @} */

/*! @name PIO0_14 (coord A3), Q4[5]
  @{ */
#define BOARD_INITPINS_LED_GREEN_GPIO GPIO        /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_LED_GREEN_PORT 0U          /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_LED_GREEN_PIN 14U          /*!<@brief 0U pin index: 14 */
                                                  /* @} */

/*! @name FC2_CTS_SDA_SSEL0 (coord D7), J28[9]/J30[5]/J47[8]/U6[6]
  @{ */
                                                                      /* @} */

/*! @name FC2_RTS_SCL_SSEL1 (coord B7), J28[10]/J30[6]/U6[4]
  @{ */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
